var data_factory = angular.module('flat_find')
    .factory('DataService', function(){

      return{

        universities: function(){
        var all_universities = [
            {"uni_name": "Академия гражданской авиации",
             "uni_lat": 43.3539289,
             "uni_long": 77.0042928
            },
            {"uni_name": "Академия дизайна и технологии «Сымбат»",
             "uni_lat": 43.2626429,
             "uni_long": 76.9462803
            }, 
            {"uni_name": "Академия КНБ РК",
             "uni_lat":43.262750,
             "uni_long":76.878429
            },
            {"uni_name": "Академия МВД РК",
             "uni_lat":43.218799,
             "uni_long":76.888234
            },
            {"uni_name": "Академия пограничной службы КНБ Республики Казахстан",
             "uni_lat":43.218128,
             "uni_long":76.961326
            },
            {"uni_name": "Алматинская Академия Экономики и Статистики (ААЭС)",
             "uni_lat":43.213004,
             "uni_long":76.867545
            },
            {"uni_name": "Алматинский гуманитарно-технический университет (АГТУ)",
             "uni_lat":43.253212,
             "uni_long":76.923686
            },
            {"uni_name": "Алматинский технологический университет (АТУ)",
             "uni_lat": 43.25269,
             "uni_long": 76.92649
            },
            {"uni_name": "Алматинский университет непрерывного образования",
             "uni_lat": 43.234431,
             "uni_long": 76.928937
            },
            {"uni_name": "Алматинский университет энергетики и связи (АУЭС)",
             "uni_lat": 43.234431,
             "uni_long": 76.928937
            },
            {"uni_name": "Алматинский филиал Санкт-Петербургского Гуманитарного Университета Профсоюзов",
             "uni_lat": 43.2652324,
             "uni_long": 76.9387562
            },
            {"uni_name": "Алматы Менеджмент Университет ALMA University (Международная академия бизнеса - МАБ)",
             "uni_lat": 43.2062969,
             "uni_long": 76.8910963
            },
            {"uni_name": "Военно-инженерный институт радиоэлектроники и связи МО РК",
             "uni_lat": 43.2173684,
             "uni_long": 76.8709884
            },
            {"uni_name": "Военный институт иностранных языков МО РК (Военный институт МО РК)",
             "uni_lat": 43.2173684,
             "uni_long": 76.8709884
            },
            {"uni_name": "Военный институт Сухопутный войск МО РК",
             "uni_lat": 43.384128,
             "uni_long": 76.992874
            },
            {"uni_name": "Евразийская юридическая академия им. Д.Кунаева",
             "uni_lat": 43.243764,
             "uni_long": 76.928200
            },
            {"uni_name": "Евразийский институт рынка (АЭУ-ЕИР) - Евразийская инновационная академия экономики и управления",
             "uni_lat": 43.205301,
             "uni_long": 76.871123
            },
            {"uni_name": "Египетский университет исламской культуры Нур-Мубарак",
             "uni_lat": 43.211844,
             "uni_long": 76.917849
            },
            {"uni_name": "Казахская Автомобильно-Дорожная Академия им. Л.Б. Гончарова (КазАДИ)",
             "uni_lat": 43.252251,
             "uni_long": 76.855834
            },
            {"uni_name": "Казахская Академия Спорта и Туризма",
             "uni_lat": 43.241457,
             "uni_long": 76.926396
            },
            {"uni_name": "Казахская академия транспорта и коммуникации им. М.Тынышбаева (КазАТК)",
             "uni_lat": 43.269719,
             "uni_long": 76.934732
            },
            {"uni_name": "Казахская Академия Труда и Социальных Отношений (КазАТиСО)",
             "uni_lat": 43.267070,
             "uni_long": 76.934393
            },
            {"uni_name": "Казахская головная архитектурно-строительная академия (КазГАСА)",
             "uni_lat": 43.204866,
             "uni_long": 76.875699
            },
            {"uni_name": "Казахская национальная академия искусств им. Жургенова (КазНАИ)",
             "uni_lat": 43.251796,
             "uni_long": 76.944487
            },
            {"uni_name": "Казахская национальная консерватория имени Курмангазы",
             "uni_lat": 43.251475,
             "uni_long": 76.942881 
            },
            {"uni_name": "Казахский государственный женский педагогический институт (КазГосЖенПУ)",
             "uni_lat": 43.258473,
             "uni_long": 76.929805
            },
            {"uni_name": "Казахский Национальный Аграрный Университет (КазНАУ)",
             "uni_lat": 43.241953,
             "uni_long": 76.952877
            },
            {"uni_name": "Казахский национальный медицинский университет им.С. Д. Асфендиярова (КазНМУ)",
             "uni_lat": 43.253027,
             "uni_long": 76.931896
            },
            {"uni_name": "Казахский национальный педагогический университет им. Абая (КазНПУ)",
             "uni_lat": 43.256462,
             "uni_long": 76.953864
            },
            {"uni_name": "Казахский национальный технический университет им. К.Сатпаева (КазНТУ)",
             "uni_lat": 43.236445,
             "uni_long": 76.929711
            },
            {"uni_name": "Казахский Национальный университет им. аль-Фараби (КазНУ)",
             "uni_lat": 43.225236,
             "uni_long": 76.921919
            },
            {"uni_name": "Казахский университет путей сообщения",
             "uni_lat": 43.210638,
             "uni_long": 76.846351
            },
            {"uni_name": "Казахско-Американский университет (КАУ)",
             "uni_lat": 43.202152,
             "uni_long": 76.871556
            },
            {"uni_name": "Казахстанский инженерно-технологический университет (КазИТУ)",
             "uni_lat": 43.213389,
             "uni_long": 76.910645
            },
            {"uni_name": "Казахстанский многопрофильный институт «Парасат» (КМИ)",
             "uni_lat": 43.228296,
             "uni_long": 76.962984
            },
            {"uni_name": "Казахстанский университет «Алатау»",
             "uni_lat": 43.259699,
             "uni_long": 76.919245
            },
            {"uni_name": "Казахстанский Университет Международных Отношений и Мировых Языков им. Аблай-хана (КазУМО)",
             "uni_lat": 43.243604,
             "uni_long": 76.920421
            },
            {"uni_name": "Казахстанско-Британский Технический Университет (КБТУ)",
             "uni_lat": 43.255184,
             "uni_long": 76.943138
            },
            {"uni_name": "Казахстанско-Немецкий университет (КНУ)",
             "uni_lat": 43.249094,
             "uni_long": 76.954185
            },
            {"uni_name": "Казахстанско-Российский медицинский университет (КРМУ)",
             "uni_lat": 43.265510,
             "uni_long": 76.932556
            },
            {"uni_name": "Каспийский Университет (Каспийский общественный университет - КОУ)",
             "uni_lat": 43.256956,
             "uni_long": 76.932043
            },
            {"uni_name": "Международный IT Университет",
             "uni_lat": 43.235099,
             "uni_long": 76.909884
            },
            {"uni_name": "Международный Казахско-Турецкий Университет им. Х.А.Ясави ЦДО, филиал",
             "uni_lat": 43.289411,
             "uni_long": 68.301270
            },
            {"uni_name": "Технико-экономическая академия кино и телевидения",
             "uni_lat": 43.240461,
             "uni_long": 76.957595
            },
            {"uni_name": "Университет им. Сулеймана Демиреля",
             "uni_lat": 43.208243,
             "uni_long": 76.669427
            },
            {"uni_name": "Университет Кайнар",
             "uni_lat": 43.238068,
             "uni_long": 76.935588
            },
            {"uni_name": "Университет Туран",
             "uni_lat": 43.237446,
             "uni_long": 76.940287
            },
            {"uni_name": "Университет Narxoz (Нархоз, Казахский Экономический Университет имени Турара Рыскулова КазЭУ)",
             "uni_lat": 43.214167,
             "uni_long": 76.871404
            },
            {"uni_name": "Университет иностранных языков и деловой карьеры",
             "uni_lat": 43.253545,
             "uni_long": 76.908733
            },
            {"uni_name": "Университет КИМЭП (Казахстанский Институт Менеджмента, Экономики и Прогнозирования - KIMEP)",
             "uni_lat": 43.241948,
             "uni_long": 76.955598
            },
            {"uni_name": "Университет Международного Бизнеса (UIB)",
             "uni_lat": 43.242210,
             "uni_long": 76.949532
            },
            {"uni_name": "Центрально-Азиатский Университет",
             "uni_lat": 43.229745,
             "uni_long": 76.895560
            }
        ];
          return all_universities;
        },
        languages: function(){
          var languages1 = ["Русский", "Английский", "Казахский"];
          return languages1;
        },
        cities: function(){
            var all_cities = ["Алматы", "Астана", "Атырау"];
            return all_cities;
        }

      }




    });

    


   
